
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Соглашение") Тогда
		ТекущаяЗапись = РегистрыСведений.СостоянияОбменовЭДЧерезОператоровЭДО.СоздатьМенеджерЗаписи();
		ТекущаяЗапись.СоглашениеОбИспользованииЭД = Параметры.Соглашение;
		ТекущаяЗапись.Прочитать();
		
		// Для новый соглашений записей в РС еще нет
		Если Не ЗначениеЗаполнено(ТекущаяЗапись.СоглашениеОбИспользованииЭД) Тогда
			ТекущаяЗапись.СоглашениеОбИспользованииЭД = Параметры.Соглашение;
		КонецЕсли;
	
		ЭтаФорма.ЗначениеВРеквизитФормы(ТекущаяЗапись, "Запись");
	КонецЕсли;
	
КонецПроцедуры