
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	СписокОтпечатковИсключения = Неопределено;
	Если Параметры.Свойство("СписокОтпечатковИсключения", СписокОтпечатковИсключения)
		И ТипЗнч(СписокОтпечатковИсключения) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Отпечаток", СписокОтпечатковИсключения,
			ВидСравненияКомпоновкиДанных.НеВСписке, , Истина);
	КонецЕсли;
	
	Организация = Неопределено;
	Если Параметры.Свойство("Организация", Организация)
		И ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", Организация,
			ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	
КонецПроцедуры
